OpenFOAM/freeSurfaceFlows-0Fv1812/cases/RayleighTaylor-v1812/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (liquid gas);

liquid
{
    transportModel  Newtonian;
    nu              nu [ 0 2 -1 0 0 0 0 ] 2.494e-3;
    rho             rho [ 1 -3 0 0 0 0 0 ] 1.255;
}

gas
{
    transportModel  Newtonian;
    nu              nu [ 0 2 -1 0 0 0 0 ]  97.8125e-3;
    rho             rho [ 1 -3 0 0 0 0 0 ] 0.032;
}

sigma           sigma [ 1 0 -2 0 0 0 0 ] 0.01;


// ************************************************************************* //
