OpenFOAM/freeSurfaceFlows-0Fv1812/cases/RayleighTaylor-v1812/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "alpha.liquid.*"
    {
        nAlphaCorr      1;
        nAlphaSubCycles 4;
        alphaOuterCorrectors yes;
        cAlpha          1;

        MULESCorr       yes;
        nLimiterIter    3;

        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0;
    }

    pcorr
    {
        solver          PCG;
        
        //preconditioner  GAMG;
        preconditioner
        {
	    preconditioner	GAMG;
	    agglomerator    faceAreaPair;
	    nCellsInCoarsestLevel 10;
	    cacheAgglomeration false;
	    nFinestSweeps   2;
	    nPostSweeps     2;
	    nPreSweeps      0;
	    smoother        DIC;
	    mergeLevels	    1;
        }
        
        tolerance       1e-5;
        relTol          0;
    }

    p_rgh
    {
        solver          PCG;
        
        //preconditioner  GAMG;
        preconditioner
        {
	    preconditioner	GAMG;
	    agglomerator    faceAreaPair;
	    nCellsInCoarsestLevel 10;
	    cacheAgglomeration false;
	    nFinestSweeps   2;
	    nPostSweeps     2;
	    nPreSweeps      0;
	    smoother        DIC;
	    mergeLevels	    1;
        }

        tolerance       1e-08;
        relTol          0.05;
        
    }

    p_rghFinal
    {
        $p_rgh;
        relTol          0;
    }
    
    pcorrFinal
    {
        $pcorr;
        relTol          0;
    }

    U
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-06;
        relTol          0;
    }
}

PIMPLE
{
    momentumPredictor   no;
    nOuterCorrectors    1;
    nCorrectors         3;
    nNonOrthogonalCorrectors 0;
    pRefCell 1;
    pRefValue 0;
}

relaxationFactors
{
    fields
    {
    }
    equations
    {
        ".*" 1;
    }
}


// ************************************************************************* //
